#Day_1\Work1.py

#Входные данные
name = input('Введите свое имя: ')
age = int(input('Введите свой возраст: '))

#Выходные данные
print("Тебя зовут",name,"и тебе",age -1 , "лет")



