#Day_1\Homework4.py

print("Меняем местами значения a и b")

#Входные данные
a = 5
b = 7
print("a =", a, "b =", b) #Выводит a = 5 b = 7

#код 
c=a
a=b
b=c
#Проверка
print("a =", a, "b =", b) #Должно вывести a = 7 b = 5



