#Day_2\Homework3.py
"""  
3. Дан прямоугольник с размерами 543×130 мм. Сколько квадратов со стороной 130 мм можно отрезать от него?
"""
print("Для прямоугольника 543х130 мм: ")
print("Входит", 543 // 130, "квадрата со сторонами по 130мм")



