"""
#Day_4\Work2.py

Ввести два числа a и b
Вывести числа от a до b

"""

a = int(input('a: '))
b = int(input('b: '))
while a <= b:
    print(a)
    a += 1
print("Операция выполнена успешно")